/* by liangjian */
/* 2009-12-21 */

function get_color_price(price, if_add_unit) /* yuan */
{
	var color = "#000";
	var unit = if_add_unit ? "（元）" : "";
	if(price >= 10 && price < 100)
		;
	else if(price >= 100 && price < 1000)
		color = "#00F";
	else if(price >= 1000 && price < 10000)
		color = "#00B400";
	else if(price >= 10000 && price < 100000)
		color = "#F00";
	else if(price >= 100000 && price < 1000000)
		color = "#F0F";
	else
		;
	return "<label style='color:" + color + "'>￥" + price.toFixed(2) + unit + "</label>"
}

var mo_shou_yao_jue = ["反击","反震","吸血","连击","飞行","夜战","隐身","感知","再生","冥思","慧根","必杀","幸运","神迹","招架","永恒","敏捷","强力","防御","偷袭","毒","驱鬼","鬼魂术","魔之心","神佑复生","精神集中","否定信仰","雷击","落岩","水攻","烈火","法术连击","法术暴击","法术波动","雷属性吸收","土属性吸收","火属性吸收","水属性吸收","迟钝","高级反击","高级反震","高级吸血","高级连击","高级飞行","高级夜战","高级隐身","高级感知","高级再生","高级冥思","高级慧根","高级必杀","高级幸运","高级神迹","高级招架","高级永恒","高级敏捷","高级强力","高级防御","高级偷袭","高级毒","高级驱鬼","高级鬼魂术","高级魔之心","高级神佑复生","高级精神集中","高级否定信仰","奔雷咒","泰山压顶","水漫金山","地狱烈火","高级雷属性吸收","高级土属性吸收","高级火属性吸收","高级水属性吸收","高级法术连击","高级法术暴击","高级法术波动","壁垒击破","嗜血追击"];
var stone_list = {4002:"太阳石", 4003:"月亮石", 4004:"光芒石", 4005:"神秘石", 4006:"红宝石", 4007:"黄宝石", 4008:"蓝宝石", 4009:"绿宝石", 4010:"黑宝石", 4011:"红玛瑙", 4012:"舍利子"};
var pet_equip_kind = {1:"铠甲", 2:"项圈", 3:"护腕"};

console.log('中文测试');
